Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
extern volatile __OFF131bits_t OFF131bits __asm__ ("OFF131") __attribute__((section("sfrs"), address(0xBF81074C)));
#define OFF132 OFF132
extern volatile uint32_t   OFF132 __attribute__((section("sfrs"), address(0xBF810750)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF132bits_t;
extern volatile __OFF132bits_t OFF132bits __asm__ ("OFF132") __attribute__((section("sfrs"), address(0xBF810750)));
#define OFF133 OFF133
extern volatile uint32_t   OFF133 __attribute__((section("sfrs"), address(0xBF810754)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF133bits_t;
extern volatile __OFF133bits_t OFF133bits __asm__ ("OFF133") __attribute__((section("sfrs"), address(0xBF810754)));
#define OFF154 OFF154
extern volatile uint32_t   OFF154 __attribute__((section("sfrs"), address(0xBF8107A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF154bits_t;
extern volatile __OFF154bits_t OFF154bits __asm__ ("OFF154") __attribute__((section("sfrs"), address(0xBF8107A8)));
#define OFF155 OFF155
extern volatile uint32_t   OFF155 __attribute__((section("sfrs"), address(0xBF8107AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF155bits_t;
extern volatile __OFF155bits_t OFF155bits __asm__ ("OFF155") __attribute__((section("sfrs"), address(0xBF8107AC)));
#define OFF156 OFF156
extern volatile uint32_t   OFF156 __attribute__((section("sfrs"), address(0xBF8107B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF156bits_t;
extern volatile __OFF156bits_t OFF156bits __asm__ ("OFF156") __attribute__((section("sfrs"), address(0xBF8107B0)));
#define OFF157 OFF157
extern volatile uint32_t   OFF157 __attribute__((section("sfrs"), address(0xBF8107B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF157bits_t;
extern volatile __OFF157bits_t OFF157bits __asm__ ("OFF157") __attribute__((section("sfrs"), address(0xBF8107B4)));
#define OFF158 OFF158
extern volatile uint32_t   OFF158 __attribute__((section("sfrs"), address(0xBF8107B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF158bits_t;
extern volatile __OFF158bits_t OFF158bits __asm__ ("OFF158") __attribute__((section("sfrs"), address(0xBF8107B8)));
#define OFF159 OFF159
extern volatile uint32_t   OFF159 __attribute__((section("sfrs"), address(0xBF8107BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF159bits_t;
extern volatile __OFF159bits_t OFF159bits __asm__ ("OFF159") __attribute__((section("sfrs"), address(0xBF8107BC)));
#define OFF160 OFF160
extern volatile uint32_t   OFF160 __attribute__((section("sfrs"), address(0xBF8107C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF160bits_t;
extern volatile __OFF160bits_t OFF160bits __asm__ ("OFF160") __attribute__((section("sfrs"), address(0xBF8107C0)));
#define OFF161 OFF161
extern volatile uint32_t   OFF161 __attribute__((section("sfrs"), address(0xBF8107C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF161bits_t;
extern volatile __OFF161bits_t OFF161bits __asm__ ("OFF161") __attribute__((section("sfrs"), address(0xBF8107C4)));
#define OFF162 OFF162
extern volatile uint32_t   OFF162 __attribute__((section("sfrs"), address(0xBF8107C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF162bits_t;
extern volatile __OFF162bits_t OFF162bits __asm__ ("OFF162") __attribute__((section("sfrs"), address(0xBF8107C8)));
#define OFF164 OFF164
extern volatile uint32_t   OFF164 __attribute__((section("sfrs"), address(0xBF8107D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF164bits_t;
extern volatile __OFF164bits_t OFF164bits __asm__ ("OFF164") __attribute__((section("sfrs"), address(0xBF8107D0)));
#define OFF165 OFF165
extern volatile uint32_t   OFF165 __attribute__((section("sfrs"), address(0xBF8107D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF165bits_t;
extern volatile __OFF165bits_t OFF165bits __asm__ ("OFF165") __attribute__((section("sfrs"), address(0xBF8107D4)));
#define OFF166 OFF166
extern volatile uint32_t   OFF166 __attribute__((section("sfrs"), address(0xBF8107D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF166bits_t;
extern volatile __OFF166bits_t OFF166bits __asm__ ("OFF166") __attribute__((section("sfrs"), address(0xBF8107D8)));
#define OFF167 OFF167
extern volatile uint32_t   OFF167 __attribute__((section("sfrs"), address(0xBF8107DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF167bits_t;
extern volatile __OFF167bits_t OFF167bits __asm__ ("OFF167") __attribute__((section("sfrs"), address(0xBF8107DC)));
#define OFF168 OFF168
extern volatile uint32_t   OFF168 __attribute__((section("sfrs"), address(0xBF8107E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF168bits_t;
extern volatile __OFF168bits_t OFF168bits __asm__ ("OFF168") __attribute__((section("sfrs"), address(0xBF8107E0)));
#define OFF179 OFF179
extern volatile uint32_t   OFF179 __attribute__((section("sfrs"), address(0xBF81080C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF179bits_t;
extern volatile __OFF179bits_t OFF179bits __asm__ ("OFF179") __attribute__((section("sfrs"), address(0xBF81080C)));
#define OFF180 OFF180
extern volatile uint32_t   OFF180 __attribute__((section("sfrs"), address(0xBF810810)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF180bits_t;
extern volatile __OFF180bits_t OFF180bits __asm__ ("OFF180") __attribute__((section("sfrs"), address(0xBF810810)));
#define OFF181 OFF181
extern volatile uint32_t   OFF181 __attribute__((section("sfrs"), address(0xBF810814)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF181bits_t;
extern volatile __OFF181bits_t OFF181bits __asm__ ("OFF181") __attribute__((section("sfrs"), address(0xBF810814)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF186 OFF186
extern volatile uint32_t   OFF186 __attribute__((section("sfrs"), address(0xBF810828)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF186bits_t;
extern volatile __OFF186bits_t OFF186bits __asm__ ("OFF186") __attribute__((section("sfrs"), address(0xBF810828)));
#define OFF187 OFF187
extern volatile uint32_t   OFF187 __attribute__((section("sfrs"), address(0xBF81082C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF187bits_t;
