Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
extern volatile __OFF216bits_t OFF216bits __asm__ ("OFF216") __attribute__((section("sfrs"), address(0xBF8108A0)));
#define OFF217 OFF217
extern volatile uint32_t   OFF217 __attribute__((section("sfrs"), address(0xBF8108A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF217bits_t;
extern volatile __OFF217bits_t OFF217bits __asm__ ("OFF217") __attribute__((section("sfrs"), address(0xBF8108A4)));
#define OFF218 OFF218
extern volatile uint32_t   OFF218 __attribute__((section("sfrs"), address(0xBF8108A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF218bits_t;
extern volatile __OFF218bits_t OFF218bits __asm__ ("OFF218") __attribute__((section("sfrs"), address(0xBF8108A8)));
#define OFF219 OFF219
extern volatile uint32_t   OFF219 __attribute__((section("sfrs"), address(0xBF8108AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF219bits_t;
extern volatile __OFF219bits_t OFF219bits __asm__ ("OFF219") __attribute__((section("sfrs"), address(0xBF8108AC)));
#define OFF220 OFF220
extern volatile uint32_t   OFF220 __attribute__((section("sfrs"), address(0xBF8108B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF220bits_t;
extern volatile __OFF220bits_t OFF220bits __asm__ ("OFF220") __attribute__((section("sfrs"), address(0xBF8108B0)));
#define OFF221 OFF221
extern volatile uint32_t   OFF221 __attribute__((section("sfrs"), address(0xBF8108B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF221bits_t;
extern volatile __OFF221bits_t OFF221bits __asm__ ("OFF221") __attribute__((section("sfrs"), address(0xBF8108B4)));
#define OFF222 OFF222
extern volatile uint32_t   OFF222 __attribute__((section("sfrs"), address(0xBF8108B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF222bits_t;
extern volatile __OFF222bits_t OFF222bits __asm__ ("OFF222") __attribute__((section("sfrs"), address(0xBF8108B8)));
#define OFF223 OFF223
extern volatile uint32_t   OFF223 __attribute__((section("sfrs"), address(0xBF8108BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF223bits_t;
extern volatile __OFF223bits_t OFF223bits __asm__ ("OFF223") __attribute__((section("sfrs"), address(0xBF8108BC)));
#define OFF224 OFF224
extern volatile uint32_t   OFF224 __attribute__((section("sfrs"), address(0xBF8108C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF224bits_t;
extern volatile __OFF224bits_t OFF224bits __asm__ ("OFF224") __attribute__((section("sfrs"), address(0xBF8108C0)));
#define OFF225 OFF225
extern volatile uint32_t   OFF225 __attribute__((section("sfrs"), address(0xBF8108C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF225bits_t;
extern volatile __OFF225bits_t OFF225bits __asm__ ("OFF225") __attribute__((section("sfrs"), address(0xBF8108C4)));
#define OFF226 OFF226
extern volatile uint32_t   OFF226 __attribute__((section("sfrs"), address(0xBF8108C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF226bits_t;
extern volatile __OFF226bits_t OFF226bits __asm__ ("OFF226") __attribute__((section("sfrs"), address(0xBF8108C8)));
#define OFF227 OFF227
extern volatile uint32_t   OFF227 __attribute__((section("sfrs"), address(0xBF8108CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF227bits_t;
extern volatile __OFF227bits_t OFF227bits __asm__ ("OFF227") __attribute__((section("sfrs"), address(0xBF8108CC)));
#define OFF228 OFF228
extern volatile uint32_t   OFF228 __attribute__((section("sfrs"), address(0xBF8108D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF228bits_t;
extern volatile __OFF228bits_t OFF228bits __asm__ ("OFF228") __attribute__((section("sfrs"), address(0xBF8108D0)));
#define OFF229 OFF229
extern volatile uint32_t   OFF229 __attribute__((section("sfrs"), address(0xBF8108D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF229bits_t;
extern volatile __OFF229bits_t OFF229bits __asm__ ("OFF229") __attribute__((section("sfrs"), address(0xBF8108D4)));
#define OFF230 OFF230
extern volatile uint32_t   OFF230 __attribute__((section("sfrs"), address(0xBF8108D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF230bits_t;
extern volatile __OFF230bits_t OFF230bits __asm__ ("OFF230") __attribute__((section("sfrs"), address(0xBF8108D8)));
#define OFF245 OFF245
extern volatile uint32_t   OFF245 __attribute__((section("sfrs"), address(0xBF810914)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF245bits_t;
extern volatile __OFF245bits_t OFF245bits __asm__ ("OFF245") __attribute__((section("sfrs"), address(0xBF810914)));
#define OFF246 OFF246
extern volatile uint32_t   OFF246 __attribute__((section("sfrs"), address(0xBF810918)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF246bits_t;
extern volatile __OFF246bits_t OFF246bits __asm__ ("OFF246") __attribute__((section("sfrs"), address(0xBF810918)));
#define OFF254 OFF254
extern volatile uint32_t   OFF254 __attribute__((section("sfrs"), address(0xBF810938)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF254bits_t;
extern volatile __OFF254bits_t OFF254bits __asm__ ("OFF254") __attribute__((section("sfrs"), address(0xBF810938)));
#define OFF255 OFF255
extern volatile uint32_t   OFF255 __attribute__((section("sfrs"), address(0xBF81093C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF255bits_t;
extern volatile __OFF255bits_t OFF255bits __asm__ ("OFF255") __attribute__((section("sfrs"), address(0xBF81093C)));
#define DMACON DMACON
extern volatile uint32_t   DMACON __attribute__((section("sfrs"), address(0xBF811000)));
typedef struct {
  uint32_t :11;
  uint32_t DMABUSY:1;
  uint32_t SUSPEND:1;
  uint32_t :2;
  uint32_t ON:1;
} __DMACONbits_t;
extern volatile __DMACONbits_t DMACONbits __asm__ ("DMACON") __attribute__((section("sfrs"), address(0xBF811000)));
extern volatile uint32_t        DMACONCLR __attribute__((section("sfrs"),address(0xBF811004)));
extern volatile uint32_t        DMACONSET __attribute__((section("sfrs"),address(0xBF811008)));
extern volatile uint32_t        DMACONINV __attribute__((section("sfrs"),address(0xBF81100C)));
#define DMASTAT DMASTAT
extern volatile uint32_t   DMASTAT __attribute__((section("sfrs"), address(0xBF811010)));
typedef struct {
  uint32_t DMACH:3;
  uint32_t :28;
  uint32_t RDWR:1;
} __DMASTATbits_t;
