Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
extern volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs"), address(0xBF860430)));
extern volatile uint32_t        LATECLR __attribute__((section("sfrs"),address(0xBF860434)));
extern volatile uint32_t        LATESET __attribute__((section("sfrs"),address(0xBF860438)));
extern volatile uint32_t        LATEINV __attribute__((section("sfrs"),address(0xBF86043C)));
#define ODCE ODCE
extern volatile uint32_t   ODCE __attribute__((section("sfrs"), address(0xBF860440)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t ODCE12:1;
    uint32_t ODCE13:1;
    uint32_t ODCE14:1;
    uint32_t ODCE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs"), address(0xBF860440)));
extern volatile uint32_t        ODCECLR __attribute__((section("sfrs"),address(0xBF860444)));
extern volatile uint32_t        ODCESET __attribute__((section("sfrs"),address(0xBF860448)));
extern volatile uint32_t        ODCEINV __attribute__((section("sfrs"),address(0xBF86044C)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF860450)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t CNPUE12:1;
    uint32_t CNPUE13:1;
    uint32_t CNPUE14:1;
    uint32_t CNPUE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs"), address(0xBF860450)));
extern volatile uint32_t        CNPUECLR __attribute__((section("sfrs"),address(0xBF860454)));
extern volatile uint32_t        CNPUESET __attribute__((section("sfrs"),address(0xBF860458)));
extern volatile uint32_t        CNPUEINV __attribute__((section("sfrs"),address(0xBF86045C)));
#define CNPDE CNPDE
extern volatile uint32_t   CNPDE __attribute__((section("sfrs"), address(0xBF860460)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t CNPDE12:1;
    uint32_t CNPDE13:1;
    uint32_t CNPDE14:1;
    uint32_t CNPDE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDEbits_t;
extern volatile __CNPDEbits_t CNPDEbits __asm__ ("CNPDE") __attribute__((section("sfrs"), address(0xBF860460)));
extern volatile uint32_t        CNPDECLR __attribute__((section("sfrs"),address(0xBF860464)));
extern volatile uint32_t        CNPDESET __attribute__((section("sfrs"),address(0xBF860468)));
extern volatile uint32_t        CNPDEINV __attribute__((section("sfrs"),address(0xBF86046C)));
#define CNCONE CNCONE
extern volatile uint32_t   CNCONE __attribute__((section("sfrs"), address(0xBF860470)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONEbits_t;
extern volatile __CNCONEbits_t CNCONEbits __asm__ ("CNCONE") __attribute__((section("sfrs"), address(0xBF860470)));
extern volatile uint32_t        CNCONECLR __attribute__((section("sfrs"),address(0xBF860474)));
extern volatile uint32_t        CNCONESET __attribute__((section("sfrs"),address(0xBF860478)));
extern volatile uint32_t        CNCONEINV __attribute__((section("sfrs"),address(0xBF86047C)));
#define CNENE CNENE
extern volatile uint32_t   CNENE __attribute__((section("sfrs"), address(0xBF860480)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t CNIEE12:1;
    uint32_t CNIEE13:1;
    uint32_t CNIEE14:1;
    uint32_t CNIEE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENEbits_t;
extern volatile __CNENEbits_t CNENEbits __asm__ ("CNENE") __attribute__((section("sfrs"), address(0xBF860480)));
extern volatile uint32_t        CNENECLR __attribute__((section("sfrs"),address(0xBF860484)));
extern volatile uint32_t        CNENESET __attribute__((section("sfrs"),address(0xBF860488)));
extern volatile uint32_t        CNENEINV __attribute__((section("sfrs"),address(0xBF86048C)));
#define CNSTATE CNSTATE
extern volatile uint32_t   CNSTATE __attribute__((section("sfrs"), address(0xBF860490)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t CNSTATE12:1;
    uint32_t CNSTATE13:1;
    uint32_t CNSTATE14:1;
    uint32_t CNSTATE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATEbits_t;
extern volatile __CNSTATEbits_t CNSTATEbits __asm__ ("CNSTATE") __attribute__((section("sfrs"), address(0xBF860490)));
extern volatile uint32_t        CNSTATECLR __attribute__((section("sfrs"),address(0xBF860494)));
extern volatile uint32_t        CNSTATESET __attribute__((section("sfrs"),address(0xBF860498)));
extern volatile uint32_t        CNSTATEINV __attribute__((section("sfrs"),address(0xBF86049C)));
#define CNNEE CNNEE
extern volatile uint32_t   CNNEE __attribute__((section("sfrs"), address(0xBF8604A0)));
typedef struct {
  uint32_t :12;
  uint32_t CNNEE12:1;
  uint32_t CNNEE13:1;
  uint32_t CNNEE14:1;
  uint32_t CNNEE15:1;
} __CNNEEbits_t;
extern volatile __CNNEEbits_t CNNEEbits __asm__ ("CNNEE") __attribute__((section("sfrs"), address(0xBF8604A0)));
extern volatile uint32_t        CNNEECLR __attribute__((section("sfrs"),address(0xBF8604A4)));
extern volatile uint32_t        CNNEESET __attribute__((section("sfrs"),address(0xBF8604A8)));
extern volatile uint32_t        CNNEEINV __attribute__((section("sfrs"),address(0xBF8604AC)));
#define CNFE CNFE
extern volatile uint32_t   CNFE __attribute__((section("sfrs"), address(0xBF8604B0)));
typedef struct {
  uint32_t :12;
  uint32_t CNFE12:1;
  uint32_t CNFE13:1;
  uint32_t CNFE14:1;
  uint32_t CNFE15:1;
} __CNFEbits_t;
extern volatile __CNFEbits_t CNFEbits __asm__ ("CNFE") __attribute__((section("sfrs"), address(0xBF8604B0)));
extern volatile uint32_t        CNFECLR __attribute__((section("sfrs"),address(0xBF8604B4)));
extern volatile uint32_t        CNFESET __attribute__((section("sfrs"),address(0xBF8604B8)));
extern volatile uint32_t        CNFEINV __attribute__((section("sfrs"),address(0xBF8604BC)));
#define SRCON0E SRCON0E
extern volatile uint32_t   SRCON0E __attribute__((section("sfrs"), address(0xBF8604C0)));
typedef struct {
  uint32_t :12;
  uint32_t SR0E12:1;
  uint32_t SR0E13:1;
  uint32_t SR0E14:1;
  uint32_t SR0E15:1;
} __SRCON0Ebits_t;
