Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
extern volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs"), address(0xBF8801D0)));
extern volatile uint32_t        C1RXF9CLR __attribute__((section("sfrs"),address(0xBF8801D4)));
extern volatile uint32_t        C1RXF9SET __attribute__((section("sfrs"),address(0xBF8801D8)));
extern volatile uint32_t        C1RXF9INV __attribute__((section("sfrs"),address(0xBF8801DC)));
#define C1RXF10 C1RXF10
extern volatile uint32_t   C1RXF10 __attribute__((section("sfrs"), address(0xBF8801E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF10bits_t;
extern volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs"), address(0xBF8801E0)));
extern volatile uint32_t        C1RXF10CLR __attribute__((section("sfrs"),address(0xBF8801E4)));
extern volatile uint32_t        C1RXF10SET __attribute__((section("sfrs"),address(0xBF8801E8)));
extern volatile uint32_t        C1RXF10INV __attribute__((section("sfrs"),address(0xBF8801EC)));
#define C1RXF11 C1RXF11
extern volatile uint32_t   C1RXF11 __attribute__((section("sfrs"), address(0xBF8801F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF11bits_t;
extern volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs"), address(0xBF8801F0)));
extern volatile uint32_t        C1RXF11CLR __attribute__((section("sfrs"),address(0xBF8801F4)));
extern volatile uint32_t        C1RXF11SET __attribute__((section("sfrs"),address(0xBF8801F8)));
extern volatile uint32_t        C1RXF11INV __attribute__((section("sfrs"),address(0xBF8801FC)));
#define C1RXF12 C1RXF12
extern volatile uint32_t   C1RXF12 __attribute__((section("sfrs"), address(0xBF880200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF12bits_t;
extern volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs"), address(0xBF880200)));
extern volatile uint32_t        C1RXF12CLR __attribute__((section("sfrs"),address(0xBF880204)));
extern volatile uint32_t        C1RXF12SET __attribute__((section("sfrs"),address(0xBF880208)));
extern volatile uint32_t        C1RXF12INV __attribute__((section("sfrs"),address(0xBF88020C)));
#define C1RXF13 C1RXF13
extern volatile uint32_t   C1RXF13 __attribute__((section("sfrs"), address(0xBF880210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF13bits_t;
extern volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs"), address(0xBF880210)));
extern volatile uint32_t        C1RXF13CLR __attribute__((section("sfrs"),address(0xBF880214)));
extern volatile uint32_t        C1RXF13SET __attribute__((section("sfrs"),address(0xBF880218)));
extern volatile uint32_t        C1RXF13INV __attribute__((section("sfrs"),address(0xBF88021C)));
#define C1RXF14 C1RXF14
extern volatile uint32_t   C1RXF14 __attribute__((section("sfrs"), address(0xBF880220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF14bits_t;
extern volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs"), address(0xBF880220)));
extern volatile uint32_t        C1RXF14CLR __attribute__((section("sfrs"),address(0xBF880224)));
extern volatile uint32_t        C1RXF14SET __attribute__((section("sfrs"),address(0xBF880228)));
extern volatile uint32_t        C1RXF14INV __attribute__((section("sfrs"),address(0xBF88022C)));
#define C1RXF15 C1RXF15
extern volatile uint32_t   C1RXF15 __attribute__((section("sfrs"), address(0xBF880230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF15bits_t;
extern volatile __C1RXF15bits_t C1RXF15bits __asm__ ("C1RXF15") __attribute__((section("sfrs"), address(0xBF880230)));
extern volatile uint32_t        C1RXF15CLR __attribute__((section("sfrs"),address(0xBF880234)));
extern volatile uint32_t        C1RXF15SET __attribute__((section("sfrs"),address(0xBF880238)));
extern volatile uint32_t        C1RXF15INV __attribute__((section("sfrs"),address(0xBF88023C)));
#define C1FIFOBA C1FIFOBA
extern volatile uint32_t   C1FIFOBA __attribute__((section("sfrs"), address(0xBF880340)));
extern volatile uint32_t        C1FIFOBACLR __attribute__((section("sfrs"),address(0xBF880344)));
extern volatile uint32_t        C1FIFOBASET __attribute__((section("sfrs"),address(0xBF880348)));
extern volatile uint32_t        C1FIFOBAINV __attribute__((section("sfrs"),address(0xBF88034C)));
#define C1FIFOCON0 C1FIFOCON0
extern volatile uint32_t   C1FIFOCON0 __attribute__((section("sfrs"), address(0xBF880350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON0bits_t;
extern volatile __C1FIFOCON0bits_t C1FIFOCON0bits __asm__ ("C1FIFOCON0") __attribute__((section("sfrs"), address(0xBF880350)));
extern volatile uint32_t        C1FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF880354)));
extern volatile uint32_t        C1FIFOCON0SET __attribute__((section("sfrs"),address(0xBF880358)));
extern volatile uint32_t        C1FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88035C)));
#define C1FIFOINT0 C1FIFOINT0
extern volatile uint32_t   C1FIFOINT0 __attribute__((section("sfrs"), address(0xBF880360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT0bits_t;
