Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
#define _RPC2R_RPC2R_POSITION                    0x00000000
#define _RPC2R_RPC2R_MASK                        0x0000001F
#define _RPC2R_RPC2R_LENGTH                      0x00000005

#define _RPC4R_RPC4R_POSITION                    0x00000000
#define _RPC4R_RPC4R_MASK                        0x0000001F
#define _RPC4R_RPC4R_LENGTH                      0x00000005

#define _RPC6R_RPC6R_POSITION                    0x00000000
#define _RPC6R_RPC6R_MASK                        0x0000001F
#define _RPC6R_RPC6R_LENGTH                      0x00000005

#define _RPC7R_RPC7R_POSITION                    0x00000000
#define _RPC7R_RPC7R_MASK                        0x0000001F
#define _RPC7R_RPC7R_LENGTH                      0x00000005

#define _RPC8R_RPC8R_POSITION                    0x00000000
#define _RPC8R_RPC8R_MASK                        0x0000001F
#define _RPC8R_RPC8R_LENGTH                      0x00000005

#define _RPC9R_RPC9R_POSITION                    0x00000000
#define _RPC9R_RPC9R_MASK                        0x0000001F
#define _RPC9R_RPC9R_LENGTH                      0x00000005

#define _RPC10R_RPC10R_POSITION                  0x00000000
#define _RPC10R_RPC10R_MASK                      0x0000001F
#define _RPC10R_RPC10R_LENGTH                    0x00000005

#define _RPC12R_RPC12R_POSITION                  0x00000000
#define _RPC12R_RPC12R_MASK                      0x0000001F
#define _RPC12R_RPC12R_LENGTH                    0x00000005

#define _RPC15R_RPC15R_POSITION                  0x00000000
#define _RPC15R_RPC15R_MASK                      0x0000001F
#define _RPC15R_RPC15R_LENGTH                    0x00000005

#define _RPD3R_RPD3R_POSITION                    0x00000000
#define _RPD3R_RPD3R_MASK                        0x0000001F
#define _RPD3R_RPD3R_LENGTH                      0x00000005

#define _RPD4R_RPD4R_POSITION                    0x00000000
#define _RPD4R_RPD4R_MASK                        0x0000001F
#define _RPD4R_RPD4R_LENGTH                      0x00000005

#define _RPD5R_RPD5R_POSITION                    0x00000000
#define _RPD5R_RPD5R_MASK                        0x0000001F
#define _RPD5R_RPD5R_LENGTH                      0x00000005

#define _RPD6R_RPD6R_POSITION                    0x00000000
#define _RPD6R_RPD6R_MASK                        0x0000001F
#define _RPD6R_RPD6R_LENGTH                      0x00000005

#define _RPE0R_RPE0R_POSITION                    0x00000000
#define _RPE0R_RPE0R_MASK                        0x0000001F
#define _RPE0R_RPE0R_LENGTH                      0x00000005

#define _RPE1R_RPE1R_POSITION                    0x00000000
#define _RPE1R_RPE1R_MASK                        0x0000001F
#define _RPE1R_RPE1R_LENGTH                      0x00000005

#define _RPE14R_RPE14R_POSITION                  0x00000000
#define _RPE14R_RPE14R_MASK                      0x0000001F
#define _RPE14R_RPE14R_LENGTH                    0x00000005

#define _RPE15R_RPE15R_POSITION                  0x00000000
#define _RPE15R_RPE15R_MASK                      0x0000001F
#define _RPE15R_RPE15R_LENGTH                    0x00000005

#define _RPF0R_RPF0R_POSITION                    0x00000000
#define _RPF0R_RPF0R_MASK                        0x0000001F
#define _RPF0R_RPF0R_LENGTH                      0x00000005

#define _RPF1R_RPF1R_POSITION                    0x00000000
#define _RPF1R_RPF1R_MASK                        0x0000001F
#define _RPF1R_RPF1R_LENGTH                      0x00000005

#define _RPG0R_RPG0R_POSITION                    0x00000000
#define _RPG0R_RPG0R_MASK                        0x0000001F
#define _RPG0R_RPG0R_LENGTH                      0x00000005

#define _RPG1R_RPG1R_POSITION                    0x00000000
#define _RPG1R_RPG1R_MASK                        0x0000001F
#define _RPG1R_RPG1R_LENGTH                      0x00000005

#define _RPG6R_RPG6R_POSITION                    0x00000000
#define _RPG6R_RPG6R_MASK                        0x0000001F
#define _RPG6R_RPG6R_LENGTH                      0x00000005

#define _RPG7R_RPG7R_POSITION                    0x00000000
#define _RPG7R_RPG7R_MASK                        0x0000001F
#define _RPG7R_RPG7R_LENGTH                      0x00000005

#define _RPG8R_RPG8R_POSITION                    0x00000000
#define _RPG8R_RPG8R_MASK                        0x0000001F
#define _RPG8R_RPG8R_LENGTH                      0x00000005

#define _RPG9R_RPG9R_POSITION                    0x00000000
#define _RPG9R_RPG9R_MASK                        0x0000001F
#define _RPG9R_RPG9R_LENGTH                      0x00000005

#define _RPG12R_RPG12R_POSITION                  0x00000000
#define _RPG12R_RPG12R_MASK                      0x0000001F
#define _RPG12R_RPG12R_LENGTH                    0x00000005

#define _HLVDCON_HLVDL_POSITION                  0x00000000
#define _HLVDCON_HLVDL_MASK                      0x0000000F
#define _HLVDCON_HLVDL_LENGTH                    0x00000004

#define _HLVDCON_HLEVT_POSITION                  0x00000008
#define _HLVDCON_HLEVT_MASK                      0x00000100
#define _HLVDCON_HLEVT_LENGTH                    0x00000001

#define _HLVDCON_BGVST_POSITION                  0x0000000A
#define _HLVDCON_BGVST_MASK                      0x00000400
#define _HLVDCON_BGVST_LENGTH                    0x00000001

#define _HLVDCON_VDIR_POSITION                   0x0000000B
#define _HLVDCON_VDIR_MASK                       0x00000800
#define _HLVDCON_VDIR_LENGTH                     0x00000001

#define _HLVDCON_SIDL_POSITION                   0x0000000D
#define _HLVDCON_SIDL_MASK                       0x00002000
#define _HLVDCON_SIDL_LENGTH                     0x00000001

#define _HLVDCON_ON_POSITION                     0x0000000F
#define _HLVDCON_ON_MASK                         0x00008000
#define _HLVDCON_ON_LENGTH                       0x00000001

#define _INTCON_INT0EP_POSITION                  0x00000000
#define _INTCON_INT0EP_MASK                      0x00000001
#define _INTCON_INT0EP_LENGTH                    0x00000001

#define _INTCON_INT1EP_POSITION                  0x00000001
#define _INTCON_INT1EP_MASK                      0x00000002
#define _INTCON_INT1EP_LENGTH                    0x00000001

#define _INTCON_INT2EP_POSITION                  0x00000002
#define _INTCON_INT2EP_MASK                      0x00000004
#define _INTCON_INT2EP_LENGTH                    0x00000001

#define _INTCON_INT3EP_POSITION                  0x00000003
#define _INTCON_INT3EP_MASK                      0x00000008
#define _INTCON_INT3EP_LENGTH                    0x00000001

#define _INTCON_INT4EP_POSITION                  0x00000004
#define _INTCON_INT4EP_MASK                      0x00000010
#define _INTCON_INT4EP_LENGTH                    0x00000001

