Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
#define _IEC3_AD1D3IE_POSITION                   0x0000000D
#define _IEC3_AD1D3IE_MASK                       0x00002000
#define _IEC3_AD1D3IE_LENGTH                     0x00000001

#define _IEC3_AD1D4IE_POSITION                   0x0000000E
#define _IEC3_AD1D4IE_MASK                       0x00004000
#define _IEC3_AD1D4IE_LENGTH                     0x00000001

#define _IEC3_AD1D5IE_POSITION                   0x0000000F
#define _IEC3_AD1D5IE_MASK                       0x00008000
#define _IEC3_AD1D5IE_LENGTH                     0x00000001

#define _IEC3_AD1D6IE_POSITION                   0x00000010
#define _IEC3_AD1D6IE_MASK                       0x00010000
#define _IEC3_AD1D6IE_LENGTH                     0x00000001

#define _IEC3_AD1D7IE_POSITION                   0x00000011
#define _IEC3_AD1D7IE_MASK                       0x00020000
#define _IEC3_AD1D7IE_LENGTH                     0x00000001

#define _IEC3_AD1D8IE_POSITION                   0x00000012
#define _IEC3_AD1D8IE_MASK                       0x00040000
#define _IEC3_AD1D8IE_LENGTH                     0x00000001

#define _IEC3_AD1D9IE_POSITION                   0x00000013
#define _IEC3_AD1D9IE_MASK                       0x00080000
#define _IEC3_AD1D9IE_LENGTH                     0x00000001

#define _IEC3_AD1D10IE_POSITION                  0x00000014
#define _IEC3_AD1D10IE_MASK                      0x00100000
#define _IEC3_AD1D10IE_LENGTH                    0x00000001

#define _IEC3_AD1D11IE_POSITION                  0x00000015
#define _IEC3_AD1D11IE_MASK                      0x00200000
#define _IEC3_AD1D11IE_LENGTH                    0x00000001

#define _IEC3_AD1D12IE_POSITION                  0x00000016
#define _IEC3_AD1D12IE_MASK                      0x00400000
#define _IEC3_AD1D12IE_LENGTH                    0x00000001

#define _IEC3_AD1D13IE_POSITION                  0x00000017
#define _IEC3_AD1D13IE_MASK                      0x00800000
#define _IEC3_AD1D13IE_LENGTH                    0x00000001

#define _IEC3_AD1D14IE_POSITION                  0x00000018
#define _IEC3_AD1D14IE_MASK                      0x01000000
#define _IEC3_AD1D14IE_LENGTH                    0x00000001

#define _IEC3_AD1D15IE_POSITION                  0x00000019
#define _IEC3_AD1D15IE_MASK                      0x02000000
#define _IEC3_AD1D15IE_LENGTH                    0x00000001

#define _IEC3_AD1D16IE_POSITION                  0x0000001A
#define _IEC3_AD1D16IE_MASK                      0x04000000
#define _IEC3_AD1D16IE_LENGTH                    0x00000001

#define _IEC3_AD1D17IE_POSITION                  0x0000001B
#define _IEC3_AD1D17IE_MASK                      0x08000000
#define _IEC3_AD1D17IE_LENGTH                    0x00000001

#define _IEC3_AD1D18IE_POSITION                  0x0000001C
#define _IEC3_AD1D18IE_MASK                      0x10000000
#define _IEC3_AD1D18IE_LENGTH                    0x00000001

#define _IEC3_AD1D19IE_POSITION                  0x0000001D
#define _IEC3_AD1D19IE_MASK                      0x20000000
#define _IEC3_AD1D19IE_LENGTH                    0x00000001

#define _IEC3_w_POSITION                         0x00000000
#define _IEC3_w_MASK                             0xFFFFFFFF
#define _IEC3_w_LENGTH                           0x00000020

#define _IEC4_AD1D24IE_POSITION                  0x00000002
#define _IEC4_AD1D24IE_MASK                      0x00000004
#define _IEC4_AD1D24IE_LENGTH                    0x00000001

#define _IEC4_AD1D25IE_POSITION                  0x00000003
#define _IEC4_AD1D25IE_MASK                      0x00000008
#define _IEC4_AD1D25IE_LENGTH                    0x00000001

#define _IEC4_AD1D26IE_POSITION                  0x00000004
#define _IEC4_AD1D26IE_MASK                      0x00000010
#define _IEC4_AD1D26IE_LENGTH                    0x00000001

#define _IEC4_AD1D27IE_POSITION                  0x00000005
#define _IEC4_AD1D27IE_MASK                      0x00000020
#define _IEC4_AD1D27IE_LENGTH                    0x00000001

#define _IEC4_AD1D48IE_POSITION                  0x0000001A
#define _IEC4_AD1D48IE_MASK                      0x04000000
#define _IEC4_AD1D48IE_LENGTH                    0x00000001

#define _IEC4_AD1D49IE_POSITION                  0x0000001B
#define _IEC4_AD1D49IE_MASK                      0x08000000
#define _IEC4_AD1D49IE_LENGTH                    0x00000001

#define _IEC4_AD1D50IE_POSITION                  0x0000001C
#define _IEC4_AD1D50IE_MASK                      0x10000000
#define _IEC4_AD1D50IE_LENGTH                    0x00000001

#define _IEC4_AD1D51IE_POSITION                  0x0000001D
#define _IEC4_AD1D51IE_MASK                      0x20000000
#define _IEC4_AD1D51IE_LENGTH                    0x00000001

#define _IEC4_AD1D52IE_POSITION                  0x0000001E
#define _IEC4_AD1D52IE_MASK                      0x40000000
#define _IEC4_AD1D52IE_LENGTH                    0x00000001

#define _IEC4_AD1D53IE_POSITION                  0x0000001F
#define _IEC4_AD1D53IE_MASK                      0x80000000
#define _IEC4_AD1D53IE_LENGTH                    0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_CMP3IE_POSITION                    0x00000000
#define _IEC5_CMP3IE_MASK                        0x00000001
#define _IEC5_CMP3IE_LENGTH                      0x00000001

#define _IEC5_CMP4IE_POSITION                    0x00000001
#define _IEC5_CMP4IE_MASK                        0x00000002
#define _IEC5_CMP4IE_LENGTH                      0x00000001

#define _IEC5_CMP5IE_POSITION                    0x00000002
#define _IEC5_CMP5IE_MASK                        0x00000004
#define _IEC5_CMP5IE_LENGTH                      0x00000001

#define _IEC5_U6EIE_POSITION                     0x00000004
#define _IEC5_U6EIE_MASK                         0x00000010
#define _IEC5_U6EIE_LENGTH                       0x00000001

#define _IEC5_U6RXIE_POSITION                    0x00000005
#define _IEC5_U6RXIE_MASK                        0x00000020
#define _IEC5_U6RXIE_LENGTH                      0x00000001

#define _IEC5_U6TXIE_POSITION                    0x00000006
#define _IEC5_U6TXIE_MASK                        0x00000040
#define _IEC5_U6TXIE_LENGTH                      0x00000001

#define _IEC5_CAN1IE_POSITION                    0x00000007
#define _IEC5_CAN1IE_MASK                        0x00000080
#define _IEC5_CAN1IE_LENGTH                      0x00000001

#define _IEC5_CAN2IE_POSITION                    0x00000008
#define _IEC5_CAN2IE_MASK                        0x00000100
#define _IEC5_CAN2IE_LENGTH                      0x00000001

