Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
#define _IPC20_T7IS_POSITION                     0x00000000
#define _IPC20_T7IS_MASK                         0x00000003
#define _IPC20_T7IS_LENGTH                       0x00000002

#define _IPC20_T7IP_POSITION                     0x00000002
#define _IPC20_T7IP_MASK                         0x0000001C
#define _IPC20_T7IP_LENGTH                       0x00000003

#define _IPC20_IC7EIS_POSITION                   0x00000008
#define _IPC20_IC7EIS_MASK                       0x00000300
#define _IPC20_IC7EIS_LENGTH                     0x00000002

#define _IPC20_IC7EIP_POSITION                   0x0000000A
#define _IPC20_IC7EIP_MASK                       0x00001C00
#define _IPC20_IC7EIP_LENGTH                     0x00000003

#define _IPC20_IC7IS_POSITION                    0x00000010
#define _IPC20_IC7IS_MASK                        0x00030000
#define _IPC20_IC7IS_LENGTH                      0x00000002

#define _IPC20_IC7IP_POSITION                    0x00000012
#define _IPC20_IC7IP_MASK                        0x001C0000
#define _IPC20_IC7IP_LENGTH                      0x00000003

#define _IPC20_OC7IS_POSITION                    0x00000018
#define _IPC20_OC7IS_MASK                        0x03000000
#define _IPC20_OC7IS_LENGTH                      0x00000002

#define _IPC20_OC7IP_POSITION                    0x0000001A
#define _IPC20_OC7IP_MASK                        0x1C000000
#define _IPC20_OC7IP_LENGTH                      0x00000003

#define _IPC20_w_POSITION                        0x00000000
#define _IPC20_w_MASK                            0xFFFFFFFF
#define _IPC20_w_LENGTH                          0x00000020

#define _IPC21_T8IS_POSITION                     0x00000000
#define _IPC21_T8IS_MASK                         0x00000003
#define _IPC21_T8IS_LENGTH                       0x00000002

#define _IPC21_T8IP_POSITION                     0x00000002
#define _IPC21_T8IP_MASK                         0x0000001C
#define _IPC21_T8IP_LENGTH                       0x00000003

#define _IPC21_IC8EIS_POSITION                   0x00000008
#define _IPC21_IC8EIS_MASK                       0x00000300
#define _IPC21_IC8EIS_LENGTH                     0x00000002

#define _IPC21_IC8EIP_POSITION                   0x0000000A
#define _IPC21_IC8EIP_MASK                       0x00001C00
#define _IPC21_IC8EIP_LENGTH                     0x00000003

#define _IPC21_IC8IS_POSITION                    0x00000010
#define _IPC21_IC8IS_MASK                        0x00030000
#define _IPC21_IC8IS_LENGTH                      0x00000002

#define _IPC21_IC8IP_POSITION                    0x00000012
#define _IPC21_IC8IP_MASK                        0x001C0000
#define _IPC21_IC8IP_LENGTH                      0x00000003

#define _IPC21_OC8IS_POSITION                    0x00000018
#define _IPC21_OC8IS_MASK                        0x03000000
#define _IPC21_OC8IS_LENGTH                      0x00000002

#define _IPC21_OC8IP_POSITION                    0x0000001A
#define _IPC21_OC8IP_MASK                        0x1C000000
#define _IPC21_OC8IP_LENGTH                      0x00000003

#define _IPC21_w_POSITION                        0x00000000
#define _IPC21_w_MASK                            0xFFFFFFFF
#define _IPC21_w_LENGTH                          0x00000020

#define _IPC22_T9IS_POSITION                     0x00000000
#define _IPC22_T9IS_MASK                         0x00000003
#define _IPC22_T9IS_LENGTH                       0x00000002

#define _IPC22_T9IP_POSITION                     0x00000002
#define _IPC22_T9IP_MASK                         0x0000001C
#define _IPC22_T9IP_LENGTH                       0x00000003

#define _IPC22_IC9EIS_POSITION                   0x00000008
#define _IPC22_IC9EIS_MASK                       0x00000300
#define _IPC22_IC9EIS_LENGTH                     0x00000002

#define _IPC22_IC9EIP_POSITION                   0x0000000A
#define _IPC22_IC9EIP_MASK                       0x00001C00
#define _IPC22_IC9EIP_LENGTH                     0x00000003

#define _IPC22_IC9IS_POSITION                    0x00000010
#define _IPC22_IC9IS_MASK                        0x00030000
#define _IPC22_IC9IS_LENGTH                      0x00000002

#define _IPC22_IC9IP_POSITION                    0x00000012
#define _IPC22_IC9IP_MASK                        0x001C0000
#define _IPC22_IC9IP_LENGTH                      0x00000003

#define _IPC22_OC9IS_POSITION                    0x00000018
#define _IPC22_OC9IS_MASK                        0x03000000
#define _IPC22_OC9IS_LENGTH                      0x00000002

#define _IPC22_OC9IP_POSITION                    0x0000001A
#define _IPC22_OC9IP_MASK                        0x1C000000
#define _IPC22_OC9IP_LENGTH                      0x00000003

#define _IPC22_w_POSITION                        0x00000000
#define _IPC22_w_MASK                            0xFFFFFFFF
#define _IPC22_w_LENGTH                          0x00000020

#define _IPC23_AD1IS_POSITION                    0x00000000
#define _IPC23_AD1IS_MASK                        0x00000003
#define _IPC23_AD1IS_LENGTH                      0x00000002

#define _IPC23_AD1IP_POSITION                    0x00000002
#define _IPC23_AD1IP_MASK                        0x0000001C
#define _IPC23_AD1IP_LENGTH                      0x00000003

#define _IPC23_AD1DC1IS_POSITION                 0x00000010
#define _IPC23_AD1DC1IS_MASK                     0x00030000
#define _IPC23_AD1DC1IS_LENGTH                   0x00000002

#define _IPC23_AD1DC1IP_POSITION                 0x00000012
#define _IPC23_AD1DC1IP_MASK                     0x001C0000
#define _IPC23_AD1DC1IP_LENGTH                   0x00000003

#define _IPC23_AD1DC2IS_POSITION                 0x00000018
#define _IPC23_AD1DC2IS_MASK                     0x03000000
#define _IPC23_AD1DC2IS_LENGTH                   0x00000002

#define _IPC23_AD1DC2IP_POSITION                 0x0000001A
#define _IPC23_AD1DC2IP_MASK                     0x1C000000
#define _IPC23_AD1DC2IP_LENGTH                   0x00000003

#define _IPC23_w_POSITION                        0x00000000
#define _IPC23_w_MASK                            0xFFFFFFFF
#define _IPC23_w_LENGTH                          0x00000020

#define _IPC24_AD1DF1IS_POSITION                 0x00000000
#define _IPC24_AD1DF1IS_MASK                     0x00000003
#define _IPC24_AD1DF1IS_LENGTH                   0x00000002

#define _IPC24_AD1DF1IP_POSITION                 0x00000002
#define _IPC24_AD1DF1IP_MASK                     0x0000001C
#define _IPC24_AD1DF1IP_LENGTH                   0x00000003

#define _IPC24_AD1DF2IS_POSITION                 0x00000008
#define _IPC24_AD1DF2IS_MASK                     0x00000300
#define _IPC24_AD1DF2IS_LENGTH                   0x00000002

#define _IPC24_AD1DF2IP_POSITION                 0x0000000A
#define _IPC24_AD1DF2IP_MASK                     0x00001C00
#define _IPC24_AD1DF2IP_LENGTH                   0x00000003

