Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
#define _CM3CON_OAO_POSITION                     0x0000000B
#define _CM3CON_OAO_MASK                         0x00000800
#define _CM3CON_OAO_LENGTH                       0x00000001

#define _CM3CON_CPOL_POSITION                    0x0000000D
#define _CM3CON_CPOL_MASK                        0x00002000
#define _CM3CON_CPOL_LENGTH                      0x00000001

#define _CM3CON_COE_POSITION                     0x0000000E
#define _CM3CON_COE_MASK                         0x00004000
#define _CM3CON_COE_LENGTH                       0x00000001

#define _CM3CON_ON_POSITION                      0x0000000F
#define _CM3CON_ON_MASK                          0x00008000
#define _CM3CON_ON_LENGTH                        0x00000001

#define _CM3CON_CFDIV_POSITION                   0x00000010
#define _CM3CON_CFDIV_MASK                       0x00070000
#define _CM3CON_CFDIV_LENGTH                     0x00000003

#define _CM3CON_CFLTREN_POSITION                 0x00000013
#define _CM3CON_CFLTREN_MASK                     0x00080000
#define _CM3CON_CFLTREN_LENGTH                   0x00000001

#define _CM3CON_CFSEL_POSITION                   0x00000014
#define _CM3CON_CFSEL_MASK                       0x00700000
#define _CM3CON_CFSEL_LENGTH                     0x00000003

#define _CM4CON_CCH_POSITION                     0x00000000
#define _CM4CON_CCH_MASK                         0x00000003
#define _CM4CON_CCH_LENGTH                       0x00000002

#define _CM4CON_CREF_POSITION                    0x00000004
#define _CM4CON_CREF_MASK                        0x00000010
#define _CM4CON_CREF_LENGTH                      0x00000001

#define _CM4CON_EVPOL_POSITION                   0x00000006
#define _CM4CON_EVPOL_MASK                       0x000000C0
#define _CM4CON_EVPOL_LENGTH                     0x00000002

#define _CM4CON_COUT_POSITION                    0x00000008
#define _CM4CON_COUT_MASK                        0x00000100
#define _CM4CON_COUT_LENGTH                      0x00000001

#define _CM4CON_CEVT_POSITION                    0x00000009
#define _CM4CON_CEVT_MASK                        0x00000200
#define _CM4CON_CEVT_LENGTH                      0x00000001

#define _CM4CON_OAO_POSITION                     0x0000000B
#define _CM4CON_OAO_MASK                         0x00000800
#define _CM4CON_OAO_LENGTH                       0x00000001

#define _CM4CON_CPOL_POSITION                    0x0000000D
#define _CM4CON_CPOL_MASK                        0x00002000
#define _CM4CON_CPOL_LENGTH                      0x00000001

#define _CM4CON_COE_POSITION                     0x0000000E
#define _CM4CON_COE_MASK                         0x00004000
#define _CM4CON_COE_LENGTH                       0x00000001

#define _CM4CON_ON_POSITION                      0x0000000F
#define _CM4CON_ON_MASK                          0x00008000
#define _CM4CON_ON_LENGTH                        0x00000001

#define _CM4CON_CFDIV_POSITION                   0x00000010
#define _CM4CON_CFDIV_MASK                       0x00070000
#define _CM4CON_CFDIV_LENGTH                     0x00000003

#define _CM4CON_CFLTREN_POSITION                 0x00000013
#define _CM4CON_CFLTREN_MASK                     0x00080000
#define _CM4CON_CFLTREN_LENGTH                   0x00000001

#define _CM4CON_CFSEL_POSITION                   0x00000014
#define _CM4CON_CFSEL_MASK                       0x00700000
#define _CM4CON_CFSEL_LENGTH                     0x00000003

#define _CM5CON_CCH_POSITION                     0x00000000
#define _CM5CON_CCH_MASK                         0x00000003
#define _CM5CON_CCH_LENGTH                       0x00000002

#define _CM5CON_CREF_POSITION                    0x00000004
#define _CM5CON_CREF_MASK                        0x00000010
#define _CM5CON_CREF_LENGTH                      0x00000001

#define _CM5CON_EVPOL_POSITION                   0x00000006
#define _CM5CON_EVPOL_MASK                       0x000000C0
#define _CM5CON_EVPOL_LENGTH                     0x00000002

#define _CM5CON_COUT_POSITION                    0x00000008
#define _CM5CON_COUT_MASK                        0x00000100
#define _CM5CON_COUT_LENGTH                      0x00000001

#define _CM5CON_CEVT_POSITION                    0x00000009
#define _CM5CON_CEVT_MASK                        0x00000200
#define _CM5CON_CEVT_LENGTH                      0x00000001

#define _CM5CON_AMPMOD_POSITION                  0x0000000A
#define _CM5CON_AMPMOD_MASK                      0x00000400
#define _CM5CON_AMPMOD_LENGTH                    0x00000001

#define _CM5CON_OAO_POSITION                     0x0000000B
#define _CM5CON_OAO_MASK                         0x00000800
#define _CM5CON_OAO_LENGTH                       0x00000001

#define _CM5CON_CPOL_POSITION                    0x0000000D
#define _CM5CON_CPOL_MASK                        0x00002000
#define _CM5CON_CPOL_LENGTH                      0x00000001

#define _CM5CON_COE_POSITION                     0x0000000E
#define _CM5CON_COE_MASK                         0x00004000
#define _CM5CON_COE_LENGTH                       0x00000001

#define _CM5CON_ON_POSITION                      0x0000000F
#define _CM5CON_ON_MASK                          0x00008000
#define _CM5CON_ON_LENGTH                        0x00000001

#define _CM5CON_CFDIV_POSITION                   0x00000010
#define _CM5CON_CFDIV_MASK                       0x00070000
#define _CM5CON_CFDIV_LENGTH                     0x00000003

#define _CM5CON_CFLTREN_POSITION                 0x00000013
#define _CM5CON_CFLTREN_MASK                     0x00080000
#define _CM5CON_CFLTREN_LENGTH                   0x00000001

#define _CM5CON_CFSEL_POSITION                   0x00000014
#define _CM5CON_CFSEL_MASK                       0x00700000
#define _CM5CON_CFSEL_LENGTH                     0x00000003

#define _DAC1CON_REFSEL_POSITION                 0x00000000
#define _DAC1CON_REFSEL_MASK                     0x00000003
#define _DAC1CON_REFSEL_LENGTH                   0x00000002

#define _DAC1CON_DACOE_POSITION                  0x00000008
#define _DAC1CON_DACOE_MASK                      0x00000100
#define _DAC1CON_DACOE_LENGTH                    0x00000001

#define _DAC1CON_ON_POSITION                     0x0000000F
#define _DAC1CON_ON_MASK                         0x00008000
#define _DAC1CON_ON_LENGTH                       0x00000001

#define _DAC1CON_DACDAT_POSITION                 0x00000010
#define _DAC1CON_DACDAT_MASK                     0xFFFF0000
#define _DAC1CON_DACDAT_LENGTH                   0x00000010

