Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
#define _C1FLTCON1_FLTEN7_POSITION               0x0000001F
#define _C1FLTCON1_FLTEN7_MASK                   0x80000000
#define _C1FLTCON1_FLTEN7_LENGTH                 0x00000001

#define _C1FLTCON1_w_POSITION                    0x00000000
#define _C1FLTCON1_w_MASK                        0xFFFFFFFF
#define _C1FLTCON1_w_LENGTH                      0x00000020

#define _C1FLTCON2_FSEL8_POSITION                0x00000000
#define _C1FLTCON2_FSEL8_MASK                    0x0000001F
#define _C1FLTCON2_FSEL8_LENGTH                  0x00000005

#define _C1FLTCON2_MSEL8_POSITION                0x00000005
#define _C1FLTCON2_MSEL8_MASK                    0x00000060
#define _C1FLTCON2_MSEL8_LENGTH                  0x00000002

#define _C1FLTCON2_FLTEN8_POSITION               0x00000007
#define _C1FLTCON2_FLTEN8_MASK                   0x00000080
#define _C1FLTCON2_FLTEN8_LENGTH                 0x00000001

#define _C1FLTCON2_FSEL9_POSITION                0x00000008
#define _C1FLTCON2_FSEL9_MASK                    0x00001F00
#define _C1FLTCON2_FSEL9_LENGTH                  0x00000005

#define _C1FLTCON2_MSEL9_POSITION                0x0000000D
#define _C1FLTCON2_MSEL9_MASK                    0x00006000
#define _C1FLTCON2_MSEL9_LENGTH                  0x00000002

#define _C1FLTCON2_FLTEN9_POSITION               0x0000000F
#define _C1FLTCON2_FLTEN9_MASK                   0x00008000
#define _C1FLTCON2_FLTEN9_LENGTH                 0x00000001

#define _C1FLTCON2_FSEL10_POSITION               0x00000010
#define _C1FLTCON2_FSEL10_MASK                   0x001F0000
#define _C1FLTCON2_FSEL10_LENGTH                 0x00000005

#define _C1FLTCON2_MSEL10_POSITION               0x00000015
#define _C1FLTCON2_MSEL10_MASK                   0x00600000
#define _C1FLTCON2_MSEL10_LENGTH                 0x00000002

#define _C1FLTCON2_FLTEN10_POSITION              0x00000017
#define _C1FLTCON2_FLTEN10_MASK                  0x00800000
#define _C1FLTCON2_FLTEN10_LENGTH                0x00000001

#define _C1FLTCON2_FSEL11_POSITION               0x00000018
#define _C1FLTCON2_FSEL11_MASK                   0x1F000000
#define _C1FLTCON2_FSEL11_LENGTH                 0x00000005

#define _C1FLTCON2_MSEL11_POSITION               0x0000001D
#define _C1FLTCON2_MSEL11_MASK                   0x60000000
#define _C1FLTCON2_MSEL11_LENGTH                 0x00000002

#define _C1FLTCON2_FLTEN11_POSITION              0x0000001F
#define _C1FLTCON2_FLTEN11_MASK                  0x80000000
#define _C1FLTCON2_FLTEN11_LENGTH                0x00000001

#define _C1FLTCON2_w_POSITION                    0x00000000
#define _C1FLTCON2_w_MASK                        0xFFFFFFFF
#define _C1FLTCON2_w_LENGTH                      0x00000020

#define _C1FLTCON3_FSEL12_POSITION               0x00000000
#define _C1FLTCON3_FSEL12_MASK                   0x0000001F
#define _C1FLTCON3_FSEL12_LENGTH                 0x00000005

#define _C1FLTCON3_MSEL12_POSITION               0x00000005
#define _C1FLTCON3_MSEL12_MASK                   0x00000060
#define _C1FLTCON3_MSEL12_LENGTH                 0x00000002

#define _C1FLTCON3_FLTEN12_POSITION              0x00000007
#define _C1FLTCON3_FLTEN12_MASK                  0x00000080
#define _C1FLTCON3_FLTEN12_LENGTH                0x00000001

#define _C1FLTCON3_FSEL13_POSITION               0x00000008
#define _C1FLTCON3_FSEL13_MASK                   0x00001F00
#define _C1FLTCON3_FSEL13_LENGTH                 0x00000005

#define _C1FLTCON3_MSEL13_POSITION               0x0000000D
#define _C1FLTCON3_MSEL13_MASK                   0x00006000
#define _C1FLTCON3_MSEL13_LENGTH                 0x00000002

#define _C1FLTCON3_FLTEN13_POSITION              0x0000000F
#define _C1FLTCON3_FLTEN13_MASK                  0x00008000
#define _C1FLTCON3_FLTEN13_LENGTH                0x00000001

#define _C1FLTCON3_FSEL14_POSITION               0x00000010
#define _C1FLTCON3_FSEL14_MASK                   0x001F0000
#define _C1FLTCON3_FSEL14_LENGTH                 0x00000005

#define _C1FLTCON3_MSEL14_POSITION               0x00000015
#define _C1FLTCON3_MSEL14_MASK                   0x00600000
#define _C1FLTCON3_MSEL14_LENGTH                 0x00000002

#define _C1FLTCON3_FLTEN14_POSITION              0x00000017
#define _C1FLTCON3_FLTEN14_MASK                  0x00800000
#define _C1FLTCON3_FLTEN14_LENGTH                0x00000001

#define _C1FLTCON3_FSEL15_POSITION               0x00000018
#define _C1FLTCON3_FSEL15_MASK                   0x1F000000
#define _C1FLTCON3_FSEL15_LENGTH                 0x00000005

#define _C1FLTCON3_MSEL15_POSITION               0x0000001D
#define _C1FLTCON3_MSEL15_MASK                   0x60000000
#define _C1FLTCON3_MSEL15_LENGTH                 0x00000002

#define _C1FLTCON3_FLTEN15_POSITION              0x0000001F
#define _C1FLTCON3_FLTEN15_MASK                  0x80000000
#define _C1FLTCON3_FLTEN15_LENGTH                0x00000001

#define _C1FLTCON3_w_POSITION                    0x00000000
#define _C1FLTCON3_w_MASK                        0xFFFFFFFF
#define _C1FLTCON3_w_LENGTH                      0x00000020

#define _C1RXF0_EID_POSITION                     0x00000000
#define _C1RXF0_EID_MASK                         0x0003FFFF
#define _C1RXF0_EID_LENGTH                       0x00000012

#define _C1RXF0_EXID_POSITION                    0x00000013
#define _C1RXF0_EXID_MASK                        0x00080000
#define _C1RXF0_EXID_LENGTH                      0x00000001

#define _C1RXF0_SID_POSITION                     0x00000015
#define _C1RXF0_SID_MASK                         0xFFE00000
#define _C1RXF0_SID_LENGTH                       0x0000000B

#define _C1RXF0_w_POSITION                       0x00000000
#define _C1RXF0_w_MASK                           0xFFFFFFFF
#define _C1RXF0_w_LENGTH                         0x00000020

#define _C1RXF1_EID_POSITION                     0x00000000
#define _C1RXF1_EID_MASK                         0x0003FFFF
#define _C1RXF1_EID_LENGTH                       0x00000012

#define _C1RXF1_EXID_POSITION                    0x00000013
#define _C1RXF1_EXID_MASK                        0x00080000
#define _C1RXF1_EXID_LENGTH                      0x00000001

