Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
#define _ADCDSTAT1_ARDY8_POSITION                0x00000008
#define _ADCDSTAT1_ARDY8_MASK                    0x00000100
#define _ADCDSTAT1_ARDY8_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY9_POSITION                0x00000009
#define _ADCDSTAT1_ARDY9_MASK                    0x00000200
#define _ADCDSTAT1_ARDY9_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY10_POSITION               0x0000000A
#define _ADCDSTAT1_ARDY10_MASK                   0x00000400
#define _ADCDSTAT1_ARDY10_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY11_POSITION               0x0000000B
#define _ADCDSTAT1_ARDY11_MASK                   0x00000800
#define _ADCDSTAT1_ARDY11_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY12_POSITION               0x0000000C
#define _ADCDSTAT1_ARDY12_MASK                   0x00001000
#define _ADCDSTAT1_ARDY12_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY13_POSITION               0x0000000D
#define _ADCDSTAT1_ARDY13_MASK                   0x00002000
#define _ADCDSTAT1_ARDY13_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY14_POSITION               0x0000000E
#define _ADCDSTAT1_ARDY14_MASK                   0x00004000
#define _ADCDSTAT1_ARDY14_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY15_POSITION               0x0000000F
#define _ADCDSTAT1_ARDY15_MASK                   0x00008000
#define _ADCDSTAT1_ARDY15_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY16_POSITION               0x00000010
#define _ADCDSTAT1_ARDY16_MASK                   0x00010000
#define _ADCDSTAT1_ARDY16_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY17_POSITION               0x00000011
#define _ADCDSTAT1_ARDY17_MASK                   0x00020000
#define _ADCDSTAT1_ARDY17_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY18_POSITION               0x00000012
#define _ADCDSTAT1_ARDY18_MASK                   0x00040000
#define _ADCDSTAT1_ARDY18_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY19_POSITION               0x00000013
#define _ADCDSTAT1_ARDY19_MASK                   0x00080000
#define _ADCDSTAT1_ARDY19_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY24_POSITION               0x00000018
#define _ADCDSTAT1_ARDY24_MASK                   0x01000000
#define _ADCDSTAT1_ARDY24_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY25_POSITION               0x00000019
#define _ADCDSTAT1_ARDY25_MASK                   0x02000000
#define _ADCDSTAT1_ARDY25_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY26_POSITION               0x0000001A
#define _ADCDSTAT1_ARDY26_MASK                   0x04000000
#define _ADCDSTAT1_ARDY26_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY27_POSITION               0x0000001B
#define _ADCDSTAT1_ARDY27_MASK                   0x08000000
#define _ADCDSTAT1_ARDY27_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY48_POSITION               0x00000010
#define _ADCDSTAT2_ARDY48_MASK                   0x00010000
#define _ADCDSTAT2_ARDY48_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY49_POSITION               0x00000011
#define _ADCDSTAT2_ARDY49_MASK                   0x00020000
#define _ADCDSTAT2_ARDY49_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY50_POSITION               0x00000012
#define _ADCDSTAT2_ARDY50_MASK                   0x00040000
#define _ADCDSTAT2_ARDY50_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY51_POSITION               0x00000013
#define _ADCDSTAT2_ARDY51_MASK                   0x00080000
#define _ADCDSTAT2_ARDY51_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY52_POSITION               0x00000014
#define _ADCDSTAT2_ARDY52_MASK                   0x00100000
#define _ADCDSTAT2_ARDY52_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY53_POSITION               0x00000015
#define _ADCDSTAT2_ARDY53_MASK                   0x00200000
#define _ADCDSTAT2_ARDY53_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE0_POSITION                0x00000000
#define _ADCCMPEN1_CMPE0_MASK                    0x00000001
#define _ADCCMPEN1_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE1_POSITION                0x00000001
#define _ADCCMPEN1_CMPE1_MASK                    0x00000002
#define _ADCCMPEN1_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE2_POSITION                0x00000002
#define _ADCCMPEN1_CMPE2_MASK                    0x00000004
#define _ADCCMPEN1_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE3_POSITION                0x00000003
#define _ADCCMPEN1_CMPE3_MASK                    0x00000008
#define _ADCCMPEN1_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE4_POSITION                0x00000004
#define _ADCCMPEN1_CMPE4_MASK                    0x00000010
#define _ADCCMPEN1_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE5_POSITION                0x00000005
#define _ADCCMPEN1_CMPE5_MASK                    0x00000020
#define _ADCCMPEN1_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE6_POSITION                0x00000006
#define _ADCCMPEN1_CMPE6_MASK                    0x00000040
#define _ADCCMPEN1_CMPE6_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE7_POSITION                0x00000007
#define _ADCCMPEN1_CMPE7_MASK                    0x00000080
#define _ADCCMPEN1_CMPE7_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE8_POSITION                0x00000008
#define _ADCCMPEN1_CMPE8_MASK                    0x00000100
#define _ADCCMPEN1_CMPE8_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE9_POSITION                0x00000009
#define _ADCCMPEN1_CMPE9_MASK                    0x00000200
#define _ADCCMPEN1_CMPE9_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE10_POSITION               0x0000000A
#define _ADCCMPEN1_CMPE10_MASK                   0x00000400
#define _ADCCMPEN1_CMPE10_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE11_POSITION               0x0000000B
#define _ADCCMPEN1_CMPE11_MASK                   0x00000800
#define _ADCCMPEN1_CMPE11_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE12_POSITION               0x0000000C
#define _ADCCMPEN1_CMPE12_MASK                   0x00001000
#define _ADCCMPEN1_CMPE12_LENGTH                 0x00000001

