Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpe064.h
/* Base Addresses for Peripherals */
#define _ADCHS_BASE_ADDRESS                      0xBF887000
#define _CAN1_BASE_ADDRESS                       0xBF880000
#define _CAN2_BASE_ADDRESS                       0xBF881000
#define _CAN3_BASE_ADDRESS                       0xBF884000
#define _CAN4_BASE_ADDRESS                       0xBF885000
#define _CDAC1_BASE_ADDRESS                      0xBF82C200
#define _CDAC2_BASE_ADDRESS                      0xBF84C400
#define _CDAC3_BASE_ADDRESS                      0xBF84C600
#define _CFG_BASE_ADDRESS                        0xBF800000
#define _CMP1_BASE_ADDRESS                       0xBF82C010
#define _CMP2_BASE_ADDRESS                       0xBF82C030
#define _CMP3_BASE_ADDRESS                       0xBF82C050
#define _CMP4_BASE_ADDRESS                       0xBF82C070
#define _CMP5_BASE_ADDRESS                       0xBF82C090
#define _CRU_BASE_ADDRESS                        0xBF801200
#define _CTMU_BASE_ADDRESS                       0xBF82D000
#define _DMAC_BASE_ADDRESS                       0xBF811000
#define _DMT_BASE_ADDRESS                        0xBF800E00
#define _EEPROM_BASE_ADDRESS                     0xBF829000
#define _HLVD_BASE_ADDRESS                       0xBF801800
#define _I2C1_BASE_ADDRESS                       0xBF826000
#define _I2C2_BASE_ADDRESS                       0xBF826200
#define _I2C3_BASE_ADDRESS                       0xBF846400
#define _I2C4_BASE_ADDRESS                       0xBF846600
#define _ICAP10_BASE_ADDRESS                     0xBF843200
#define _ICAP11_BASE_ADDRESS                     0xBF843400
#define _ICAP12_BASE_ADDRESS                     0xBF843600
#define _ICAP13_BASE_ADDRESS                     0xBF843800
#define _ICAP14_BASE_ADDRESS                     0xBF843A00
#define _ICAP15_BASE_ADDRESS                     0xBF843C00
#define _ICAP16_BASE_ADDRESS                     0xBF843E00
#define _ICAP1_BASE_ADDRESS                      0xBF822000
#define _ICAP2_BASE_ADDRESS                      0xBF822200
#define _ICAP3_BASE_ADDRESS                      0xBF822400
#define _ICAP4_BASE_ADDRESS                      0xBF822600
#define _ICAP5_BASE_ADDRESS                      0xBF822800
#define _ICAP6_BASE_ADDRESS                      0xBF822A00
#define _ICAP7_BASE_ADDRESS                      0xBF822C00
#define _ICAP8_BASE_ADDRESS                      0xBF822E00
#define _ICAP9_BASE_ADDRESS                      0xBF823000
#define _INT_BASE_ADDRESS                        0xBF810000
#define _NVM_BASE_ADDRESS                        0xBF800A00
#define _OCMP10_BASE_ADDRESS                     0xBF845200
#define _OCMP11_BASE_ADDRESS                     0xBF845400
#define _OCMP12_BASE_ADDRESS                     0xBF845600
#define _OCMP13_BASE_ADDRESS                     0xBF845800
#define _OCMP14_BASE_ADDRESS                     0xBF845A00
#define _OCMP15_BASE_ADDRESS                     0xBF845C00
#define _OCMP16_BASE_ADDRESS                     0xBF845E00
#define _OCMP1_BASE_ADDRESS                      0xBF824000
#define _OCMP2_BASE_ADDRESS                      0xBF824200
#define _OCMP3_BASE_ADDRESS                      0xBF824400
#define _OCMP4_BASE_ADDRESS                      0xBF824600
#define _OCMP5_BASE_ADDRESS                      0xBF824800
#define _OCMP6_BASE_ADDRESS                      0xBF824A00
#define _OCMP7_BASE_ADDRESS                      0xBF824C00
#define _OCMP8_BASE_ADDRESS                      0xBF824E00
#define _OCMP9_BASE_ADDRESS                      0xBF825000
#define _PCACHE_BASE_ADDRESS                     0xBF800800
#define _PMP_BASE_ADDRESS                        0xBF82E000
#define _PORTA_BASE_ADDRESS                      0xBF860020
#define _PORTB_BASE_ADDRESS                      0xBF860120
#define _PORTC_BASE_ADDRESS                      0xBF860220
#define _PORTD_BASE_ADDRESS                      0xBF860320
#define _PORTE_BASE_ADDRESS                      0xBF860420
#define _PORTF_BASE_ADDRESS                      0xBF860520
#define _PORTG_BASE_ADDRESS                      0xBF860620
#define _RTCC_BASE_ADDRESS                       0xBF8C0000
#define _SB_BASE_ADDRESS                         0xBF8F0510
#define _SPI1_BASE_ADDRESS                       0xBF827000
#define _SPI2_BASE_ADDRESS                       0xBF827200
#define _SPI3_BASE_ADDRESS                       0xBF847400
#define _SPI4_BASE_ADDRESS                       0xBF847600
#define _SPI5_BASE_ADDRESS                       0xBF847800
#define _SPI6_BASE_ADDRESS                       0xBF847A00
#define _TMR1_BASE_ADDRESS                       0xBF820000
#define _TMR2_BASE_ADDRESS                       0xBF820200
#define _TMR3_BASE_ADDRESS                       0xBF820400
#define _TMR4_BASE_ADDRESS                       0xBF820600
#define _TMR5_BASE_ADDRESS                       0xBF820800
#define _TMR6_BASE_ADDRESS                       0xBF820A00
#define _TMR7_BASE_ADDRESS                       0xBF820C00
#define _TMR8_BASE_ADDRESS                       0xBF820E00
#define _TMR9_BASE_ADDRESS                       0xBF821000
#define _UART1_BASE_ADDRESS                      0xBF828000
#define _UART2_BASE_ADDRESS                      0xBF828200
#define _UART3_BASE_ADDRESS                      0xBF848400
#define _UART4_BASE_ADDRESS                      0xBF848600
#define _UART5_BASE_ADDRESS                      0xBF848800
#define _UART6_BASE_ADDRESS                      0xBF848A00
#define _UARTAB_BASE_ADDRESS                     0xBF828000
#define _UARTCD_BASE_ADDRESS                     0xBF828200
#define _UARTEF_BASE_ADDRESS                     0xBF848400
#define _UARTGH_BASE_ADDRESS                     0xBF848600
#define _UARTJK_BASE_ADDRESS                     0xBF848800
#define _UARTLM_BASE_ADDRESS                     0xBF848A00
#define _USB1_BASE_ADDRESS                       0xBF889040
#define _USB_BASE_ADDRESS                        0xBF889040
#define _WDT_BASE_ADDRESS                        0xBF800C00
#define __DDPSTAT_BASE_ADDRESS                   0xBF801010

